welcome to data science class

In [1]:
import pandas as pd

In [2]:
data = { 'apples': [2, 1, 4, 3], 'bananas': [2, 5, 1, 0] }

In [3]:
buying = pd.DataFrame(data)

In [4]:
buying

   apples  bananas
0       2        2
1       1        5
2       4        1
3       3        0

In [5]:
print(buying)

   apples  bananas
0       2        2
1       1        5
2       4        1
3       3        0

In [6]:
# change index 0,1,2,3 ke 'Jane', 'Daniel', 'May', 'Jack'
buying = pd.DataFrame(data, index=['Jane', 'Daniel', 'May', 'Jack'])
buying

        apples  bananas
Jane         2        2
Daniel       1        5
May          4        1
Jack         3        0

In [7]:
# sebab name of index column kosong, kita nak bagi nama jadi customer
buying.index.name='customer' #to give index column a name
buying

          apples  bananas
customer
Jane           2        2
Daniel         1        5
May            4        1
Jack           3        0

In [12]:
buying.loc['Jane']

apples     2
bananas    2
Name: Jane, dtype: int64

In [11]:
buying.iloc[0]

apples     2
bananas    2
Name: Jane, dtype: int64

In [9]:
df = pd.DataFrame(buying, columns=['apples'])
df.to_csv(r'buying_3.csv', index = True, header=True)

In [10]:
# df = pd.DataFrame(buying, columns=['apples','bananas'])
df = pd.DataFrame(buying)
df.to_csv(r'buying.csv', index = True, header=True) # i want index n header dlm csv, jadi letak True